Процедура ЗаписатьПользователяИБ()
	
	Если Пароль <> ПодтверждениеПароля Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Введенные пароли не совпадают";
		ПодтверждениеПароля = "";
		Возврат;
	КонецЕсли;
	
    ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Объект.ИдентификаторПользователяИБ);
    
    Если ПользовательИБ = Неопределено Тогда
        ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
    КонецЕсли;
    
    ПользовательИБ.Имя = Объект.Код;
    ПользовательИБ.ПолноеИмя = Объект.Наименование;
    
    Если ЗначениеЗаполнено(Пароль) Тогда
        ПользовательИБ.Пароль = Пароль;
    КонецЕсли;
    
    Объект.ИдентификаторПользователяИБ = ПользовательИБ.УникальныйИдентификатор;
	
КонецПроцедуры