#Область ОбработчикиСобытий
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
    
    Если ПользователиИнформационнойБазы.ПолучитьПользователей().Количество() = 0 Тогда
        
        Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "В программе не обнаружен ни один пользователь. + 
							|Будет создан пользователь Администратор";
		Сообщение.Сообщить();
		
        // Создаем нового пользователя ИБ
        АдминИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
        АдминИБ.Имя = "Администратор";
        АдминИБ.ПолноеИмя = "Администратор (системный)";
        АдминИБ.Роли.Добавить(Метаданные.Роли.ПолныеПрава);
        АдминИБ.Записать();

        НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
        НовыйПользователь.Наименование = "Администратор";
        НовыйПользователь.ИдентификаторПользователяИБ = АдминИБ.УникальныйИдентификатор;
        НовыйПользователь.Записать();
        
    КонецЕсли;
    
    ТекущийПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
    ПользовательСсылка = Справочники.Пользователи.НайтиПоРеквизиту("ИдентификаторПользователяИБ", ТекущийПользовательИБ.УникальныйИдентификатор);
    Если НЕ ПользовательСсылка.Пустая() Тогда
    	ПараметрыСеанса.ТекущийПользователь = ПользовательСсылка;
    Иначе
    	Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "В программе не обнаружен пользователь";
		Сообщение.Сообщить();
    КонецЕсли;
    
КонецПроцедуры
#КонецОбласти