
Процедура ПередЗаписью(Отказ)
	
	Если НЕ РольДоступна("ПолныеПрава") И Ссылка <> ПараметрыСеанса.ТекущийПользователь  Тогда
		Отказ = Истина;
		Сообщить("У вас недостаточно прав для изменения этого пользователя");
		Возврат;
	КонецЕсли;
	
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ИдентификаторПользователяИБ);
	
	Если ПользовательИБ = Неопределено Тогда
		ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();	
	КонецЕсли;
	
	ПользовательИБ.Имя = Логин; // Логин из реквизита справочника
    ПользовательИБ.Пароль = Пароль; 
    ПользовательИБ.Записать();
    
    ИдентификаторПользователяИБ = ПользовательИБ.УникальныйИдентификатор;

КонецПроцедуры
